In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
! pip install lxml

Requirement already satisfied: lxml in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (4.8.0)

In [6]:
! pip install html5lib

Requirement already satisfied: html5lib in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (from html5lib) (0.5.1)

In [10]:
! pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (4.11.1)
Requirement already satisfied: soupsieve>1.2 in /Users/alissatory/opt/anaconda3/lib/python3.9/site-packages (from BeautifulSoup4) (2.3.1)

In [11]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [12]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

## CSV
 *CSV Input

In [13]:
df = df[0]

In [14]:
df.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [15]:
#Saving as cvs file 
df.to_csv('example', index=False)

In [16]:
df = pd.read_csv('example')
df.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [17]:
# to get names of columns 
df.columns

Index(['Bank NameBank', 'CityCity', 'StateSt', 'CertCert',
       'Acquiring InstitutionAI', 'Closing DateClosing', 'FundFund'],
      dtype='object')

In [18]:
new_columns = ['NameBank', 'City', 'State', 'Cert',
       'Acquiring_InstitutionAI', ' Date_Closing', 'Fund']

In [19]:
df.columns = new_columns

In [20]:
df.head(1)

,NameBank,City,State,Cert,Acquiring_InstitutionAI,Date_Closing,Fund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538

In [21]:
# To obtain more information about your data frame columns 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 563 entries, 0 to 562
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   NameBank                 563 non-null    object
 1   City                     563 non-null    object
 2   State                    563 non-null    object
 3   Cert                     563 non-null    int64
 4   Acquiring_InstitutionAI  563 non-null    object
 5    Date_Closing            563 non-null    object
 6   Fund                     563 non-null    int64
dtypes: int64(2), object(5)
memory usage: 30.9+ KB

# Groupby Method

In [22]:
group_df = df.groupby('State')

In [23]:
group_df['Fund'].mean()

State
AL    10247.142857
AR     8874.500000
AZ     9930.062500
CA    10045.317073
CO    10293.100000
CT     7572.500000
FL    10062.421053
GA    10203.752688
HI     4645.000000
IA    10265.000000
ID    10274.500000
IL    10069.318841
IN    10309.666667
KS    10278.090909
KY    10375.666667
LA     8948.500000
MA    10211.000000
MD    10302.700000
MI     9824.571429
MN    10259.826087
MO    10250.750000
MS    10300.500000
NC    10320.857143
NE    10308.000000
NH     4647.000000
NJ     9793.000000
NM    10253.333333
NV    10167.750000
NY     9079.600000
OH     9008.222222
OK    10353.142857
OR    10148.000000
PA     9768.200000
PR    10300.750000
SC    10346.000000
SD    10081.000000
TN     9633.714286
TX     9799.769231
UT     9531.625000
VA    10342.400000
WA    10257.052632
WI     9856.909091
WV    10275.000000
WY    10080.000000
Name: Fund, dtype: float64

## Excel Input

In [24]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

three columns one day, one year, one